In [6]:
import pandas as pd

### 1. Question: How can we load the CSV file into a Pandas DataFrame?

In [7]:
import pandas as pd

df=pd.read_csv("sales_data.csv")

In [8]:
print(df)

       Name Product Name  Sale Price    MRP  Rating   Sale Date
0     Alice     Product1       100.0  120.0     4.5  01-08-2023
1       Bob     Product2       150.0  170.0     4.0  02-08-2023
2   Charlie          NaN       200.0    NaN     3.5  03-08-2023
3     David     Product4         NaN  210.0     5.0  04-08-2023
4       Eva     Product5       250.0  270.0     NaN  05-08-2023
5     Frank          NaN       300.0  320.0     4.7         NaN
6     Grace     Product7       350.0    NaN     4.1  07-08-2023
7     Helen     Product8         NaN  370.0     3.8  08-08-2023
8       Ivy     Product9       400.0  420.0     NaN         NaN
9      Jack          NaN       450.0    NaN     4.3  10-08-2023
10     Kara    Product11       500.0  520.0     4.9  11-08-2023
11      Leo    Product12         NaN  570.0     NaN         NaN
12     Mona    Product13       550.0    NaN     3.9  13-08-2023
13     Nina    Product14       600.0  620.0     4.6  14-08-2023
14    Oscar          NaN       650.0  670.0     4.2  15-08-2023

### 2. Display first 7 records

In [9]:
df.head(7)

      Name Product Name  Sale Price    MRP  Rating   Sale Date
0    Alice     Product1       100.0  120.0     4.5  01-08-2023
1      Bob     Product2       150.0  170.0     4.0  02-08-2023
2  Charlie          NaN       200.0    NaN     3.5  03-08-2023
3    David     Product4         NaN  210.0     5.0  04-08-2023
4      Eva     Product5       250.0  270.0     NaN  05-08-2023
5    Frank          NaN       300.0  320.0     4.7         NaN
6    Grace     Product7       350.0    NaN     4.1  07-08-2023

###  3.Display last 7 records

In [10]:
df.tail(7)

     Name Product Name  Sale Price    MRP  Rating   Sale Date
8     Ivy     Product9       400.0  420.0     NaN         NaN
9    Jack          NaN       450.0    NaN     4.3  10-08-2023
10   Kara    Product11       500.0  520.0     4.9  11-08-2023
11    Leo    Product12         NaN  570.0     NaN         NaN
12   Mona    Product13       550.0    NaN     3.9  13-08-2023
13   Nina    Product14       600.0  620.0     4.6  14-08-2023
14  Oscar          NaN       650.0  670.0     4.2  15-08-2023

### 4. Question: What are the basic statistics of the numeric columns in the DataFrame?

In [11]:
# To Find statices from data columns we used describle().

df.describe()

       Sale Price         MRP     Rating
count   12.000000   11.000000  12.000000
mean   375.000000  387.272727   4.291667
std    180.277564  188.366181   0.460155
min    100.000000  120.000000   3.500000
25%    237.500000  240.000000   3.975000
50%    375.000000  370.000000   4.250000
75%    512.500000  545.000000   4.625000
max    650.000000  670.000000   5.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          15 non-null     object
 1   Product Name  11 non-null     object
 2   Sale Price    12 non-null     float64
 3   MRP           11 non-null     float64
 4   Rating        12 non-null     float64
 5   Sale Date     12 non-null     object
dtypes: float64(3), object(3)
memory usage: 852.0+ bytes

In [13]:
df.describe().T # After Transfose result.

,count,mean,std,min,25%,50%,75%,max
Sale Price,12.0,375.000000,180.277564,100.0,237.500,375.00,512.500,650.0
MRP,11.0,387.272727,188.366181,120.0,240.000,370.00,545.000,670.0
Rating,12.0,4.291667,0.460155,3.5,3.975,4.25,4.625,5.0

### 5. Question: How many unique products are in the DataFrame?

In [14]:
unique_product=df["Product Name"].unique()
print(unique_product)
print("Total Number of unique Prduct ",len(unique_product))

['Product1' 'Product2' nan 'Product4' 'Product5' 'Product7' 'Product8'
 'Product9' 'Product11' 'Product12' 'Product13' 'Product14']
Total Number of unique Prduct  12

In [15]:
# Count unique products dont include unique values
unique_product=df["Product Name"].nunique()
print(f'Number of unique products: {unique_product}')

Number of unique products: 11

## 6. Find Total number or records in data

In [19]:
print(df.shape)

print("Toatl No. of Records are:",df.shape[0])
print("Total No. of Columns are:",df.shape[1])

(15, 6)
Toatl No. of Records are: 15
Total No. of Columns are: 6

## 7. Print names of all columns

In [24]:
print("Columns Names are:",df.columns.tolist())

Columns Names are: ['Name', 'Product Name', 'Sale Price', 'MRP', 'Rating', 'Sale Date']

## 8. Find wheter MRP column is available or not in columns

In [25]:
print("MRP" in df.columns)

True

In [30]:
for col_name in df.columns:
    if col_name == "MRP".upper():
        print("Yes MRP is there")
        break
else:
    print("MRP is not there")

Yes MRP is there